// src/components/pages/education.jsx
export default function buttonDemo() {
  return (
    <div className="flex justify-center items-center gap-4 mb-4 flex-wrap">
        <div className="flex gap-4 flex-wrap">
          {/*Show both icons */}
          <p className="rtl:text-right rtl:flex-row-reverse text-3xl leading-normal font-body font-regular mb-6">قرآن و سنت میں "اسلام" کو "دین" کے طور پر متعارف کرایا گیا ہے:-۔

اِنَّ الدِّيۡنَ عِنۡدَ اللّٰهِ الۡاِسۡلَامُ

'اللہ کے نزدیک حقیقی دین صرف اسلام ہے!'

دین نام ہے اُس منظم، منضبط، جامع اور اکمل ضابطے کا جو انسانی زندگی کے انفرادی اور اجتماعی گوشوں کو اپنے مدار میں لاتا، اپنے رنگ میں رنگتا اور اپنی تعلیمات کے پیکر میں ڈھالتا ہے۔ کوئی بھی پہلو اُس کی دسترس سے باہر نہیں رہتا. اسلام اپنے پیروؤں اور ماننے والوں سے تقاضا کرتا ہے

اُدۡخُلُوۡا فِى السِّلۡمِ کَآفَّۃ

 (داخل ہو جاؤ دین میں پورے کے پورے)"

چنانچہ:

اُن کے افکار و عقائد کو ہر طرح کی ثنویت، تثلیث، تشکیک سے پاک کر کے اَحدیت کے دائرہ میں لاتا ہے
اُن کے اخلاق و کردار کو مطھّر اور پاکیزہ بنا کر اِس قابل کرتا ہے کہ وہ ہر آن، ہر لحظہ "رضائے الٰہی اور فلاحِ اُخروی" کو مطمعِ نظر بنائیں اور وہ مطلوب معاشرہ قائم و برپا کرنے کی جدوجہد میں لگ جائیں جس کی کلید "عبادتِ رب اور اتّباعِ رسولﷺ" ہو.
انفرادی اور اجتماعی زندگی کے ہر ہر میدان میں کارکردگی اور کارگزاری کے ایسے شواہد و مناظر منصّۂ شہود پر آ جائیں جو عالَمِ انسانیت کیلئے وجۂ ترغیب و تقلید بنیں
۔اُنہیں دین کی اقامت کے بارِ گراں کی ادائیگی کیلئے اُس منہج کو اختیار کرنے کی تلقین کرتا ہے.جو جنابِ نبی اکرمﷺ کی ذاتِ اقدس اور وَ الَّذِیْنَ مَعَهٗۤ کی جماعت کا طریقہ کار تھا
شبان المسلمین بحمداللہ اُس تحریک کا نام ہے جو اِنہی اغراض و مقاصد کے بالفعل حصول کیلئے برپا کی گئی ہے اور جو پاکستان کو "سایۂ خدائے ذوالجلال" کے مصداق دورِ جدید کی بہترین، مثالی، اسلامی، شورائی، جمہوری اور فلاحی ریاست بنانے کی ہر ممکنہ کاوش و سعی کرے گی تا کہ ثُمَّ تَكُونُ خِلَافَةً عَلٰى مِنهَاجِ النُّبُوَّةٍ کا خواب شرمندۂ تعبیر ہو سکے، اِن شآء اللہ۔

اِس تحریک کی بنیادوں میں ڈاکٹر اسرار احمدؒ کی دینی، تحریکی اور عمرانی فکر شامل ہے۔ ڈاکٹر صاحبؒ نے اپنی مختلف تحاریر اور تقاریر میں ہمیشہ اُن ہستیوں کا تفصیل سے ذکر کیا جن سے اُنہوں نے کسبِ فیض کیا تھا۔ اور در حقیقت شبان المسلمین کی بنیادوں میں ڈاکٹر اسرار احمدؒ کے ذریعے اُن حضرات کی فکر شامل ہے۔ مذکورہ شخصیات کا مختصر تعارف پیشِ خدمت ہے

 </p>
        </div>
    </div>
    
  );
}